{
  "_id": {
    "$oid": "575887798177dd0f00cd3e5b"
  },
  "slug": "zebra-story-tellers",
  "formattedDate": "Wed Jun 08 2016",
  "coverImage": "https://dft010l2k5dxv.cloudfront.net/blogpost_zebrastorytellers.jpg",
  "title": "Zebra Story Tellers",
  "contentPreview": "<p>Your own personal story; everyone has one, and no one’s is the same. It is one of the best avenues to understand someone. It is also one of the most effective ways to connect with someone, even though you may bring completely diverse experiences to the table.</p>\n\n<p>The moments, memories, and experiences you share with a friend is a transfer of your story for them to envision in their mind. After your story is shared with your friend it is natural to compare those experiences to your own. From that point a connection in the brain is developed through relations. You feel what they felt, and you begin to empathize.</p>\n\n<p><a href=\"/blog/zebra-story-tellers\">read more</a></p>",
  "content": "<p>Your own personal story; everyone has one, and no one’s is the same. It is one of the best avenues to understand someone. It is also one of the most effective ways to connect with someone, even though you may bring completely diverse experiences to the table.</p>\n\n<p>The moments, memories, and experiences you share with a friend is a transfer of your story for them to envision in their mind. After your story is shared with your friend it is natural to compare those experiences to your own. From that point a connection in the brain is developed through relations. You feel what they felt, and you begin to empathize.</p>\n\n<p>Eventually, a story teller’s audience will begin to synchronize the feelings of the story teller. For example, if the teller explains hardship, the audience will feel this. Just like in a soap opera when the audience says “Awe” during a moment of sadness. Or at times when a character is presenting something funny, there is laughter from the audience.</p>\n\n<p>There is a special level of importance in mankind for storytelling. In order to better connect with the EDS community and all those affected by EDS, we want to hear your stories. No matter how short or long, detailed or straight the point, we want to hear it all!</p>\n\n<p>Everyone has their own journey, as did James, and it is important that we all connect to better understand this rare genetic disorder. Storytelling can unite us &amp; help make the EDS community stronger.</p>\n\n<p>Since Ehlers-Danlos syndrome is so unique, I mean we are Zebras, we each present with such unique backgrounds and situations. Even the whole process that an individual goes through to be diagnosed with this rare genetic disorder is unique!</p>\n\n<p>For example, while growing up, my brother James always had these distinct veins, and they would spontaneously rupture. When we would play or horse around, like normal kids, it would result in ruptured veins and unusually large bruises. It got worse as he grew older and played baseball. Our family knew that any time the ball would go near him there would be extreme ruptures of his veins and extensive bruising.</p>\n\n<p>My mother did everything in her power for James to be seen by various specialists to narrow down any possible answers. It wasn’t until he was 18 years old that Ehlers-Danlos syndrome became a topic of discussion. He had faced several spontaneous ruptures at this point, and even after that point it took two years for him to be diagnosed.”</p>\n\n<p>Throughout our blogs we will be discussing James’ Journey with EDS and we want to hear your journeys with EDS. Are you or a family being considered for testing? Have you already been tested? What was your/your family’s process for being tested? After EDS testing what were/are your options now? What treatment course of actions have you decided? What can we do together about this?</p>\n\n<p>We want to hear all about it!! Our Zebra stories can help bring our community together. We all have one, and each one of is very different.</p>\n\n<p><strong>References</strong></p>\n\n<p><a href=\"https://goo.gl/HVNxIY\">https://goo.gl/HVNxIY</a></p>",
  "authorId": {
    "$oid": "575623c27ecae70f000f3f7b"
  },
  "authorFullname": "Laura",
  "authorThumbnailUrl": "http://imgur.com/cP9ftBk.png",
  "pageViews": 34,
  "social": [],
  "hasReadMoreBtn": true,
  "tags": [
    "red",
    "green",
    "blue"
  ],
  "dateAdded": {
    "$date": "2016-06-08T21:00:41.430Z"
  },
  "isFeatured": false,
  "__v": 0
}